app/channels/messages_channel.rb

  def subscribed
    classroom = Classroom.find(params[:classroom_id])
---
SELECT  "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]