app/controllers/classrooms_controller.rb

SELECT "classrooms".* FROM "classrooms"
---
  def index
    @classrooms = Classroom.all

SELECT  "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @classroom = Classroom.find(params[:id])

INSERT INTO "classrooms" ("name", "subject", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Single Source"], ["subject", "coding"], ["created_at", "2018-11-27 15:19:01.707323"], ["updated_at", "2018-11-27 15:19:01.707323"]]
---
  def create
    @classroom = Classroom.new(name: params[:name], subject: params[:subject])
    if @classroom.save