app/controllers/messages_controller.rb

SELECT  "classrooms".* FROM "classrooms" WHERE "classrooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "messages" ("context", "user_id", "classroom_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["context", "e"], ["user_id", 2], ["classroom_id", 1], ["created_at", "2018-11-23 18:19:35.013775"], ["updated_at", "2018-11-23 18:19:35.013775"]]
---
  def create
    message = Message.new(message_params)
    classroom = Classroom.find(message_params[:classroom_id])
    if message.save