app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "bryan"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(username: user_params[:username])